In [1]:
people = {
    "first": ["Karthik", 'Ajith', 'Moni'], 
    "last": ["Raja", 'Dheiva', 'Singh'], 
    "email": ["KarthikRaja@gmail.com", 'AjithDheiva@email.com', 'MoniSingh@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

     first    last                  email
0  Karthik    Raja  KarthikRaja@gmail.com
1    Ajith  Dheiva  AjithDheiva@email.com
2     Moni   Singh    MoniSingh@email.com

In [4]:
df['email']

0    KarthikRaja@gmail.com
1    AjithDheiva@email.com
2      MoniSingh@email.com
Name: email, dtype: object

In [7]:
df.set_index('email', inplace=True)

In [8]:
df

                         first    last
email
KarthikRaja@gmail.com  Karthik    Raja
AjithDheiva@email.com    Ajith  Dheiva
MoniSingh@email.com       Moni   Singh

In [9]:
df.loc['AjithDheiva@email.com']

first     Ajith
last     Dheiva
Name: AjithDheiva@email.com, dtype: object

In [10]:
df.loc['AjithDheiva@email.com', 'last']

'Dheiva'

In [11]:
df.reset_index()

                   email    first    last
0  KarthikRaja@gmail.com  Karthik    Raja
1  AjithDheiva@email.com    Ajith  Dheiva
2    MoniSingh@email.com     Moni   Singh

In [12]:
df

                         first    last
email
KarthikRaja@gmail.com  Karthik    Raja
AjithDheiva@email.com    Ajith  Dheiva
MoniSingh@email.com       Moni   Singh

In [13]:
df.reset_index(inplace=True)

In [14]:
df

                   email    first    last
0  KarthikRaja@gmail.com  Karthik    Raja
1  AjithDheiva@email.com    Ajith  Dheiva
2    MoniSingh@email.com     Moni   Singh